pub fn to_buckwalter(text: &String) -> String {
    text.chars().map(|c| match c {
        'ء' => '\'',
        'آ' => '|',
        'أ' => '>',
        'ؤ' => '&',
        'إ' => '<',
        'ئ' => '}',
        'ا' => 'A',
        'ب' => 'b',
        'ة' => 'p',
        'ت' => 't',
        'ث' => 'v',
        'ج' => 'j',
        'ح' => 'H',
        'خ' => 'x',
        'د' => 'd',
        'ذ' => '*',
        'ر' => 'r',
        'ز' => 'z',
        'س' => 's',
        'ش' => '$',
        'ص' => 'S',
        'ض' => 'D',
        'ط' => 'T',
        'ظ' => 'Z',
        'ع' => 'E',
        'غ' => 'g',
        'ـ' => '_',
        'ف' => 'f',
        'ق' => 'q',
        'ك' => 'k',
        'ل' => 'l',
        'م' => 'm',
        'ن' => 'n',
        'ه' => 'h',
        'و' => 'w',
        'ى' => 'Y',
        'ي' => 'y',
        '\u{064B}' => 'F',
        '\u{064C}' => 'N',
        '\u{064D}' => 'K',
        '\u{064E}' => 'a',
        '\u{064F}' => 'u',
        '\u{0650}' => 'i',
        '\u{0651}' => '~',
        '\u{0652}' => 'o',
        '\u{0670}' => '`',
        '\u{0671}' => '{',
        'پ' => 'P',
        'چ' => 'J',
        'ڤ' => 'V',
        'ژ' => 'R',
        'گ' => 'G',
        '،' => ',',
        '؛' => ';',
        '؟' => '?',
        _ => c
    }).collect()
}

#[cfg(test)]
mod tests {
    use super::*;

    #[test]
    fn it_converts_correctly() {
        let word = String::from("فيسبوك");

        assert_eq!(to_buckwalter(&word), "fysbwk");
    }
}
